# ფუნქციები რომლებიც ერთი მონაცემთა ტიპიდან გადაყვათ მეორეში 
# ამ შემთხვევაში int(),str() და float() ქვიათ მექანიკური მონაცემთა ტიპის შეცვლა
# მექანიკურში ვგულისხმობ იმას რომ ჩვენ ჩვენი ხელით გარდავქმნით ერთი ტიპიდან მეორეში

# int() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ინტეჯერად ანუ მთელ რიცხვად.
print(int(6.9))
print(int("6") + 6)

# float() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ათწილად რიცხვად.
print(float("9.6"))
print(float(6))

# str() ეს ფუნქცია გვეხმარება იმაში რომ ნებისმიერი მნიშვნელობა გარდავქმნათ სტრინგად.
print(str(4) + "4")
print(str(7.6) + "7")

# type() ეს ფუნქცია გვეხმარება იმაში რომ გავიგოთ კონკრეტული მნიშვნელობა რა ტიპის არის.
print(type(5.4))
print(type(6))
print(type("Gigi"))